{
    "format": "layers-model",
    "generatedBy": "keras v2.3.0-tf",
    "convertedBy": "TensorFlow.js Converter v3.0.0",
    "modelTopology": {
        "keras_version": "2.3.0-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "model_10",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                241
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "Categoric"
                        },
                        "name": "Categoric",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                6
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "Numeric"
                        },
                        "name": "Numeric",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "concatenate_5",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1
                        },
                        "name": "concatenate_5",
                        "inbound_nodes": [
                            [
                                [
                                    "Categoric",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "Numeric",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_30",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.0,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_30",
                        "inbound_nodes": [
                            [
                                [
                                    "concatenate_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_35",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_35",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_30",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_31",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.0,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_31",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_35",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_36",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_36",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_31",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_32",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.0,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_32",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_36",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_37",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 8,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_37",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_32",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_33",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.0,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_33",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_37",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "Categoric",
                        0,
                        0
                    ],
                    [
                        "Numeric",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dropout_33",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_35/kernel",
                    "shape": [
                        247,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_35/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_36/kernel",
                    "shape": [
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_36/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_37/kernel",
                    "shape": [
                        64,
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_37/bias",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}